{
	"pluginmetadataversion" : 2,
	"name": "Dependency analyzer",
	"type": ["helper"],
	"api": ["python2", "python3"],
	"description": "Analyze dependencies and resolve obfuscated imports",
	"longdescription": "Dependency Analyzer is a Binary Ninja plugin for analyzing module dependencies in a more in-depth fashion and recovering important information such as import names from metadata files.\n\nSupported formats:\n\n* [Microsoft Module Definition (.def)](https://docs.microsoft.com/en-us/cpp/build/reference/module-definition-dot-def-files?view=vs-2019) files\n* IDA's IDT files\n* Anything loadable by Binary Ninja (including databases with renamed functions)\n\nCurrent analyses:\n\n* Resolve imported symbol names\n  - Import-by-ordinal\n  - Import-by-address (e.g. embedded systems)\n  - From renamed functions in a Binary Ninja database (e.g. manually analyzed obfuscated symbol names)\n\nIt will try to find files in `depanalyzer.path` with the same basename of any of the dependencies, and analyze them if they match anything loadable by the plugin.\n\nSymbol matching can done in three ways:\n\n* By name\n* By address (non-relocatable binaries only)\n* By ordinal (PE binaries only)\n\nThe current method is settable through `depanalyzer.matching_method`, globally and per-context.\nBy default, and upon encountering a method that is inapplicable to the current binary, it will try to determine the best method automatically.\n",
	"license": {
		"name": "MIT",
		"text": "Copyright (c) 2020 Shiz\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE."
	},
	"platforms" : ["Darwin", "Linux", "Windows"],
	"installinstructions" : {},
	"dependencies": {},
	"version": "1.0",
	"author": "Shiz",
	"minimumbinaryninjaversion": 1200
}
